Use titanic dataset. Handle the null values and convert the categorical values into numerical values. Make a classification model using k-nn classifier to predict the survival of a passenger on the ship. Use “gridsearchCV( )” to find the best value of ‘k’.

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import StandardScaler
from sklearn.neighbors import KNeighborsClassifier
from sklearn.model_selection import train_test_split
from sklearn import metrics as m

In [2]:
titanic_df=pd.read_csv('https://raw.githubusercontent.com/kajalpanda1/DatasetRepository/master/Titanic.csv')

In [4]:
titanic_df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [5]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 156 entries, 0 to 155
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  156 non-null    int64
 1   Survived     156 non-null    int64
 2   Pclass       156 non-null    int64
 3   Name         156 non-null    object
 4   Sex          156 non-null    object
 5   Age          126 non-null    float64
 6   SibSp        156 non-null    int64
 7   Parch        156 non-null    int64
 8   Ticket       156 non-null    object
 9   Fare         156 non-null    float64
 10  Cabin        31 non-null     object
 11  Embarked     155 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 14.8+ KB

In [6]:
titanic_df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [7]:
titanic_df=titanic_df.drop(columns=['PassengerId','Name','Ticket','Fare','Cabin'])

In [8]:
titanic_df.columns

Index(['Survived', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Embarked'], dtype='object')

In [9]:
titanic_df['Age']=titanic_df['Age'].fillna(titanic_df['Age'].median())

In [10]:
titanic_df['Embarked']=titanic_df['Embarked'].fillna('ffill')

In [11]:
le=LabelEncoder()
titanic_df['Embarked']=le.fit_transform(titanic_df['Embarked'])
titanic_df['Sex']=le.fit_transform(titanic_df['Sex'])

In [13]:
feature_df=titanic_df.iloc[:,1:].values
target_df=titanic_df.iloc[:,0].values

In [14]:
feature_df.shape

(156, 6)

In [15]:
target_df.shape

(156,)

In [16]:
ss=StandardScaler()
feature_df=ss.fit_transform(feature_df)

In [17]:
#using GridSearchCV to fing best value of k
from sklearn.model_selection import GridSearchCV
param_grid={'n_neighbors':np.arange(2,50)}
knn=KNeighborsClassifier()
knn_cv=GridSearchCV(knn,param_grid,cv=5)
knn_cv.fit(feature_df,target_df)

print(knn_cv.best_score_)
print(knn_cv.best_params_)

0.8078629032258066
{'n_neighbors': 17}

In [19]:
X_train,X_test,Y_train,Y_test=train_test_split(feature_df,target_df,test_size=0.3,random_state=10)

In [20]:
model=KNeighborsClassifier(n_neighbors=17)
model.fit(X_train,Y_train)

KNeighborsClassifier(algorithm='auto', leaf_size=30, metric='minkowski',
                     metric_params=None, n_jobs=None, n_neighbors=17, p=2,
                     weights='uniform')

In [21]:
y_pred=model.predict(X_test)

In [22]:
print(m.accuracy_score(Y_test,y_pred)*100)

80.85106382978722